app/controllers/messages_controller.rb

SELECT * FROM `messages`
---
  def index
    @messages = Message.all

SELECT * FROM `messages` WHERE (`messages`.`id` = 3)
---
  def show
    @message = Message.find(params[:id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 14)
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO `messages` (`created_at`, `body`, `updated_at`, `user_id`, `user_agent`) VALUES('2009-12-10 14:48:28', 'Hello everybody', '2009-12-10 14:48:28', 0, 'FireFox')
---
  def create
    @message = Message.new(params[:message])
    @message.user_agent = request.env["HTTP_USER_AGENT"].split(" ").first
    @message.user_id = current_user.id

    respond_to do |format|
      if @message.save

SELECT * FROM `messages` WHERE (`messages`.`id` = 20)
---
  def update
    @message = Message.find(params[:id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 14)
DELETE FROM `messages` WHERE `id` = 14
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy