app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('c-2YfZV8QmkT18CWSAIV', '2009-12-03 14:55:21', '2009-12-03 14:55:21', '8e40a10625c924bab001cfd876eb398346b3a75134f924552cdcf843b642f1c33c2816426e752c359aef9034f6313bce2eda57898af72e36047b4f971c8be9f9', 'V3mtbe_H74NorPks0hLq', '2009-12-03 14:55:21', 0, '130.79.7.1', '5BELtsuJhn6T-LvANBYR', '2009-12-03 14:55:21', '8132fd3d605d1dab3bb1670bfc13bf1a140dec61a2f75750e5bf0d51604e786bc67c56ce5bfdf10888e900bee6d19cf6ce0cae41fe4a782975ea209ea485abf4', 1, NULL, 'Altris', NULL, 'jeremaltris@hotmail.fr')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`login` = 'Jeremy') LIMIT 1
SELECT * FROM `messages` WHERE (`messages`.user_id = 1) ORDER BY messages.created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `messages` WHERE (`messages`.user_id = 1)
---
  def show
  	#@user = User.find params[:id]
	@user = User.find_by_login(params[:id])
	@messages = @user.messages.paginate(:page => params[:page], :per_page => 5, :order => 'messages.created_at DESC')

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @user = User.find params[:id]

SELECT * FROM `messages` ORDER BY messages.created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `messages`
---
   def index # Rajout pour faire un listing de tous les messages de tous les utilisateurs
    @messages = Message.paginate(:page => params[:page], :per_page => 5, :order => 'messages.created_at DESC')